#ifndef _TASKS_H_
#define	_TASKS_H_
#include "stm32f10x.h"

/******************************************************************************
							全局变量声明
*******************************************************************************/ 
extern int16_t TEMP[2];
extern u8 flag_usart;
/******************************************************************************
							全局函数声明
*******************************************************************************/ 
void Task_1000HZ(void);
void Task_20HZ(void);
void Task_500HZ(void);
void Task_250HZ(void);
void Task_CNT(void);
void Led_Blink(void);
#endif

